_posts/2021-10-11-boj-4358.html
---
title: BOJ 4358 생태학
tags: STL
---

<div id="outline-container-org096846d" class="outline-2">
<h2 id="org096846d">BOJ 4358 생태학</h2>
</div>

<div id="outline-container-org78be363" class="outline-2">
<h2 id="org78be363">접근하기</h2>
<div class="outline-text-2" id="text-org78be363">
<ul class="org-ul">
<li>getline으로 줄단위 입력으로 string 객체 받음</li>
<li>map 객체에 이름을 key로 빈도를 value로 받음</li>
<li>오름차순 정렬의 set객체에 이름을 저장</li>
<li>set을 순회하면서, 빈도 출력</li>
</ul>
</div>
</div>

<div id="outline-container-org8e304c8" class="outline-2">
<h2 id="org8e304c8">코드</h2>
<div class="outline-text-2" id="text-org8e304c8">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;iostream&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;set&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;map&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;string&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">map</span>&lt;<span style="color: #8ae234; font-weight: bold;">string</span>, <span style="color: #8ae234; font-weight: bold;">int</span>&gt; <span style="color: #ff6347;">mp</span>;
<span style="color: #8ae234; font-weight: bold;">set</span>&lt;<span style="color: #8ae234; font-weight: bold;">string</span>, <span style="color: #8ae234; font-weight: bold;">less</span>&lt;<span style="color: #8ae234; font-weight: bold;">string</span>&gt;&gt; <span style="color: #ff6347;">st</span>; <span style="color: #888a85;">// </span><span style="color: #888a85;">&#51665;&#54633;&#44061;&#52404;, sorted&#49345;&#53468; &#50976;&#51648;</span>

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    <span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347;">line</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">sum</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">while</span>(getline(cin, line)) {
        st.insert(line);
        mp[line] += 1;
        sum += 1;
    }

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #729fcf; font-weight: bold;">auto</span>&amp; <span style="color: #ff6347;">o</span>:st) {
        printf(<span style="color: #ad7fa8; font-style: italic;">"%s %.4f\n"</span>, o.c_str(), 100* (<span style="color: #8ae234; font-weight: bold;">float</span>)mp[o]/sum);
    }     
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd033e7d" class="outline-2">
<h2 id="orgd033e7d">문제 링크</h2>
<div class="outline-text-2" id="text-orgd033e7d">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/4358">https://www.acmicpc.net/problem/4358</a></li>
</ul>
</div>
</div>
